; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 266447 2 3 2 7 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph0 - mode
	image1 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star0 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 image1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument3 image1)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 spectrograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
)
(:goal (and
	(pointing satellite0 GroundStation2)
	(pointing satellite1 Star0)
	(have_image Star7 image1)
	(have_image Planet8 spectrograph0)
	(have_image Star9 image1)
))

)

; plan
1. (turn_to satellite1 star0 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star0)
   goals met: 1 of 5
2. (turn_to satellite0 groundstation2 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 groundstation2)
   goals met: 2 of 5
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 5
4. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 2 of 5
5. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 2 of 5
6. (calibrate satellite1 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 2 of 5
7. (turn_to satellite0 star9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star9)
   goals met: 1 of 5
8. (turn_to satellite1 planet8 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet8)
   goals met: 0 of 5
9. (take_image satellite1 planet8 instrument4 spectrograph0)
   added: (have_image planet8 spectrograph0)
   goals met: 1 of 5
10. (take_image satellite0 star9 instrument0 image1)
   added: (have_image star9 image1)
   goals met: 2 of 5
11. (turn_to satellite1 star0 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star0)
   goals met: 3 of 5
12. (turn_to satellite0 star7 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star7)
   goals met: 3 of 5
13. (take_image satellite0 star7 instrument0 image1)
   added: (have_image star7 image1)
   goals met: 4 of 5
14. (turn_to satellite0 groundstation2 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation2)
   goals met: 5 of 5
